<template>
    <div class="detail">
        <!-- 顶部 -->
        <div class="top">
            <div class="title">
                <span>{{ hosDetail.getHospitalDetail?.full_name }}</span>
            </div>
            <div class="grade">
                <svg t="1745935908882" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2659" width="16" height="16"><path d="M259.60156269 433.88281277h-93.75000019a10.82812473 10.82812473 0 0 0-10.82812473 10.85156186v390.2812501c0 5.97656223 4.8515625 10.82812473 10.82812473 10.82812554h93.75000018V433.88281277z m64.9218749-3.3281249v415.2890624h447.09374982a10.82812473 10.82812473 0 0 0 10.80468759-10.82812554V830.74999963l86.484375-324.93749936a97.57031232 97.57031232 0 0 0-97.28906259-93.6093749h-181.12500028l7.54687574-38.71875064c5.15625018-26.62500009 11.32031277-45.28125027 11.32031195-81.56249946V247.53125009c0-53.7890625-43.6640625-71.78906223-97.35937482-71.78906222-53.67187518 0-97.35937481 17.99999973-97.35937481 71.78906222v44.43750028c0 50.85937463-28.42968741 82.03125037-84.49218732 133.42968732l-5.62500028 5.15625018z m447.09374982 480.32812463H165.82812537A75.89062491 75.89062491 0 0 1 90.125 835.01562473V444.73437463a75.89062491 75.89062491 0 0 1 75.70312537-75.8906249h129.515625c26.60156213-26.13281287 54.39843787-41.29687491 54.39843704-76.89843732V247.50781213C349.74218741 157.85937463 422.51562491 110.67968769 512 110.67968769s162.25781259 47.15624981 162.25781259 136.82812444v44.43750028c0 25.71093787-2.62500019 31.68750009-5.97656222 55.21874991h103.33593704c89.48437509 0 162.25781259 72.93749991 162.25781259 162.60937536v4.26562509l-86.6953125 325.78124936a75.91406287 75.91406287 0 0 1-75.56250009 71.06250037z" fill="#515151" p-id="2660"></path></svg>
                <span>{{ hosDetail.getHospitalDetail?.grade_name }}</span>
            </div>
        </div>
        <!-- 内容 -->
        <div class="content">
            <div class="left">
                <img src="@/assets/imgs/xyt/hostipal.png" alt="">
            </div>
            <div class="right">
                <div class="address">
                    具体位置: {{ hosDetail.getHospitalDetail?.address }}
                </div>
            </div>
        </div>
        <div class="footer">
            <p>医院介绍</p>
            <p>
                北京协和医院是集医疗、教学、科研于一体的现代化综合三级甲等医院，是国家卫生健康委指定的全国疑难重症诊治指导中心，最早承担外宾医疗任务的医院之一，也是高等医学教育和住院医师规范化培训国家级示范基地，临床医学研究和技术创新的国家级核心基地。以学科齐全、技术力量雄厚、特色专科突出、多学科综合优势强大享誉海内外。

医院建成于1921年，由洛克菲勒基金会创办。建院之初，就志在“建成亚洲最好的医学中心”。一百年来，形成了“严谨、求精、勤奋、奉献”的协和精神和“立院为国、立医为民、立学为真”的协和品格，创立了“三基”、“三严”的现代医学教育理念，形成了以“教授、病案、图书馆”著称的协和“三宝”，培养造就了张孝骞、林巧稚等一代医学大师和多位中国现代医学的领军人物，创建了当今知名的10余家大型综合及专科医院。医院创新性提出了“待病人如亲人，提高病人满意度；待同事如家人，提高员工幸福感”的办院理念；提炼出了“学术、品质、人文”的百年协和内涵；全面推进医疗服务体系、人才培养体系、科技创新体系、精细管理体系、开放协作体系、党建文化体系等“六大体系”建设。

目前，医院总建筑面积62万余平方米，在编职工4300余人、两院院士3人、临床医技及平台科室64个、国家临床重点专科29个，疑难重症及罕见病全国重点实验室、转化医学国家重大科技基础设施、国家妇产疾病临床医学研究中心、国家皮肤与免疫疾病临床医学研究中心等国家级科研平台6个，国家“双一流”建设学科5个、国家重点学科12个、一级学科博士学位授权点9个、国家级继续医学教育基地6个、国家住院医师规范化培训专业基地22个、国家专科医师规范化培训试点基地8个。开放住院床位2000余张，2024年手术量7万余例、年出院病人12余万人次。先后获“全国文明单位”“全国卫生系统先进集体”“全国先进基层党组织”“全国抗击新冠肺炎先进集体”等称号。同时，医院还承担着支援欠发达地区、国家重要活动医疗保障和突发事件主力医疗队的重任。

协和人以执着的医志、高尚的医德、精湛的医术和严谨的学风书写了辉煌的历史。在新百年新征程中，协和人将始终秉承“以人民为中心，一切为了患者”的办院方向，建设国家医学中心，打造“中国特色、世界一流医院”，为全方位全生命周期护佑人民生命健康、建设成为领航中国医学发展的“国之重器”而努力奋斗。
            </p>
        </div>
    </div>
</template>

<script setup lang="ts">
import {useHosDetailStore} from '@/store/xyt/index'

let hosDetail = useHosDetailStore();
</script>

<style scoped lang="scss">
.detail {
    .top{
        display: flex;
        align-items: center;
        .title{
            display: flex;
            font-size: 18px;
            font-weight: 600;
        }
        .grade{
            display: flex;
            color: #7f7f7f;
            margin-left: 10px;
        }
    }
    .content{
        display: flex;
        margin-top: 20px;
        .left{
            width: 80px;
            img{
                width: 80px;
                height: 80px;
            }
        }
        .right{
            flex: 1;
            .time, .address, .canceltime {
                margin-top: 10px;
                color: #7f7f7f;
            }
        }
    }
    .footer{
        p {
            color: #7f7f7f;
            margin-top: 10px;
            line-height: 30px;
        }
    }
}
</style>